# IsDimensionCalculated Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..IsDimensionCalculated Method
FabricationPart Class See Also
---
Checks if the fabrication dimension is calculated.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsDimensionCalculated(
	FabricationDimensionDefinition dim
)
```

Visual Basic
---
```text
Public Function IsDimensionCalculated ( _
	dim As FabricationDimensionDefinition _
) As Boolean
```

Visual C++
---
```text
public:
bool IsDimensionCalculated(
	FabricationDimensionDefinition^ dim
)
```

# ### Parameters
dim
    Type: Autodesk.Revit.DB..::..FabricationDimensionDefinition The fabrication dimension.
# ### Return Value
True if the fabrication dimension is calculated.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace